reny736/AI-PET-ESP32/src/realtime_voice_app.cpp
    WiFiClient client;
    HTTPClient http;
    if (!http.begin(client, manifest_url)) {
        error = "manifest connect failed";
        return false;
    }

    http.setTimeout(app::kOtaHttpTimeoutMs);
    const int http_code = http.GET();
    if (http_code != HTTP_CODE_OK) {
        error = String("manifest GET failed: ") + http_code;
        http.end();
        return false;
    }

    const String payload = http.getString();
    http.end();

    DynamicJsonDocument doc(app::kOtaManifestJsonBytes);
    const DeserializationError json_error = deserializeJson(doc, payload);
    if (json_error) {
        error = String("manifest JSON parse failed: ") + json_error.c_str();
        return false;
    }

    JsonObjectConst root = doc.as<JsonObjectConst>();
    if (root.isNull()) {
        error = "manifest root is not object";
        return false;
    }

    JsonObjectConst manifest = root;
    const char* target_key = target == OtaTarget::Esp32Self ? "esp32" : "stm32";
    if (root[target_key].is<JsonObjectConst>()) {
        manifest = root[target_key].as<JsonObjectConst>();
    }

    resolution.version = trimCopy(String(manifest["version"] | ""));
    resolution.url = trimCopy(String(manifest["firmware_url"] | ""));
    if (resolution.url.length() == 0) {
        resolution.url = trimCopy(String(manifest["url"] | ""));
    }
    if (resolution.url.length() == 0) {
        resolution.url = trimCopy(String(manifest["firmware_name"] | ""));
    }
    resolution.url = makeAbsoluteOtaUrl(resolution.url);
    resolution.sha256 = trimCopy(String(manifest["sha256"] | ""));
    if (resolution.sha256.length() == 0) {
        resolution.sha256 = trimCopy(String(manifest["sha256sum"] | ""));
    }
    resolution.md5 = trimCopy(String(manifest["md5"] | ""));
    resolution.update_log = trimCopy(String(manifest["update_log"] | ""));
    resolution.manifest_used = true;

    if (resolution.url.length() == 0) {
        error = "manifest missing firmware_url";
        return false;
    }

    const String current_version = currentOtaVersion(target);
    if (current_version.length() > 0 &&
        resolution.version.length() > 0 &&
        resolution.version.equalsIgnoreCase(current_version)) {
        resolution.already_latest = true;
    }

    return true;
}

bool resolveConfiguredOtaRequest(
    OtaTarget target,
    OtaRequestResolution& resolution,
    String& detail) {
    resolution = OtaRequestResolution();
    resolution.url = String(defaultOtaUrl(target));
    resolution.sha256 = String(defaultOtaSha256(target));

    OtaRequestResolution manifest_resolution;
    String manifest_error;
    if (fetchManifestResolution(target, manifest_resolution, manifest_error)) {
        resolution = manifest_resolution;
        detail = String("manifest=") + defaultOtaManifestUrl(target);
        return true;
    }

    if (resolution.url.length() > 0) {
        detail = manifest_error.length() > 0
                     ? String("manifest unavailable, fallback direct: ") + manifest_error
                     : "direct package";
        return true;
    }

    detail = manifest_error.length() > 0 ? manifest_error : "OTA package is not configured";
    return false;
}

}  // namespace

RealtimeVoiceApp::RealtimeVoiceApp()
    : led_(app::kRgbLedPin),
      aux_serial_(1),
      state_(AppState::Booting),
      session_ready_(false),
      tts_ended_(false),
      reconnect_scheduled_(false),
      reconnect_after_playback_(false),
      audio_uplink_enabled_(false),
      api_activation_requested_(false),
      ota_mode_request_seen_(false),
      ota_esp32_button_enabled_(false),
      ota_stm32_button_enabled_(false),
      ota_esp32_button_raw_(false),
      ota_stm32_button_raw_(false),
      ota_esp32_button_pressed_(false),
      ota_stm32_button_pressed_(false),
      watchdog_enabled_(false),
      reconnect_at_ms_(0),
      last_audio_rx_ms_(0),
      last_tts_ended_ms_(0),
      last_monitor_ms_(0),
      listening_started_ms_(0),
      thinking_started_ms_(0),
      ota_mode_started_ms_(0),
      ota_last_attempt_ms_(0),
      ota_esp32_button_changed_ms_(0),
      ota_stm32_button_changed_ms_(0),
      last_watchdog_feed_ms_(0) {
    session_config_.bot_name = app::kBotName;
    session_config_.system_role = app::kSystemRole;
    session_config_.speaking_style = app::kSpeakingStyle;
    session_config_.speaker = app::kSpeaker;
    session_config_.location_city = app::kLocationCity;
    session_config_.model = app::kDialogModel;
    session_config_.recv_timeout_seconds = app::kRecvTimeoutSeconds;
    session_config_.strict_audit = app::kStrictAudit;
}

bool RealtimeVoiceApp::begin() {
    Serial.begin(115200);
    const uint32_t serial_wait_started_ms = millis();
    while (!Serial && (millis() - serial_wait_started_ms) < 1500) {
        delay(10);
    }
    delay(100);

    LOGI("APP", "ESP32-S3 Doubao realtime voice");
    LOGI(
        "APP",
        "heap=%u psram=%u",
        static_cast<unsigned>(ESP.getFreeHeap()),
        static_cast<unsigned>(ESP.getFreePsram()));
    const String installed_esp32_version = currentOtaVersion(OtaTarget::Esp32Self);
    const String installed_stm32_version = currentOtaVersion(OtaTarget::Stm32);
    LOGI("APP", "firmware=%s build=%s %s", installed_esp32_version.c_str(), __DATE__, __TIME__);
    LOGI(
        "APP",
        "versions esp32=%s stm32=%s",
        installed_esp32_version.c_str(),
        installed_stm32_version.c_str());
    beginWatchdog();

    led_.begin();
    setState(AppState::Booting);

    if (!beginAuxSerial()) {
        LOGE("APP", "Aux serial init failed");
        return false;
    }
    beginOtaButtons();

    if (!audio_.begin()) {
        LOGE("APP", "Audio pipeline init failed");
        return false;
    }
    ota_.begin(aux_serial_);
    loadSpeakerVolumePreference();
    printSerialHelp();

    audio_.setSpeechCallback([this](bool speaking) { handleSpeechStateChanged(speaking); });
    ws_client_.setMessageCallback(
        [this](const uint8_t* data, size_t len) { handleSocketMessage(data, len); });
    ws_client_.setDisconnectCallback([this]() { handleSocketDisconnected(); });

    if (!connectWiFi()) {
        scheduleReconnect("initial WiFi connect failed");
        return true;
    }

    setState(AppState::Standby);
    LOGI(
        "APP",
        "WiFi ready, waiting aux serial trigger 0x%02X on UART1 RX=%d TX=%d",
        static_cast<unsigned>(app::kApiTriggerByte),
        app::kAuxSerialRxPin,
        app::kAuxSerialTxPin);
    return true;
}

void RealtimeVoiceApp::loop() {
    serviceOtaButtons();

    if (state_ == AppState::Ota) {
        led_.update();
        serviceSerialCommands();
        serviceOtaMode();
        feedWatchdog();
        delay(1);
        return;
    }

    ws_client_.loop();
    led_.update();

    serviceSerialCommands();
    serviceAuxSerial();
    serviceAudioUplink();
    serviceConversationState();
    reconnectIfNeeded();
    printMonitor();

    feedWatchdog();
    delay(1);
}

bool RealtimeVoiceApp::beginWatchdog() {
#if ESP_IDF_VERSION_MAJOR >= 5
    esp_task_wdt_config_t config = {
        .timeout_ms = app::kWatchdogTimeoutMs,
        .idle_core_mask = 0,
        .trigger_panic = true,
    };
    const esp_err_t init_err = esp_task_wdt_init(&config);
#else
    const esp_err_t init_err =
        esp_task_wdt_init((app::kWatchdogTimeoutMs + 999UL) / 1000UL, true);
#endif

    if (init_err != ESP_OK && init_err != ESP_ERR_INVALID_STATE) {
        LOGW("WDT", "Task watchdog init failed: %d", init_err);
        return false;
    }

