reny736/AI-PET-ESP32/src/realtime_voice_app.cpp
    const esp_err_t add_err = esp_task_wdt_add(nullptr);
    if (add_err != ESP_OK && add_err != ESP_ERR_INVALID_STATE) {
        LOGW("WDT", "Task watchdog subscribe failed: %d", add_err);
        return false;
    }

    watchdog_enabled_ = true;
    feedWatchdog(true);
    LOGI("WDT", "Task watchdog enabled timeout=%u ms", static_cast<unsigned>(app::kWatchdogTimeoutMs));
    return true;
}

void RealtimeVoiceApp::feedWatchdog(bool force) {
    if (!watchdog_enabled_) {
        return;
    }

    const uint32_t now = millis();
    if (!force && (now - last_watchdog_feed_ms_) < app::kWatchdogFeedIntervalMs) {
        return;
    }

    if (esp_task_wdt_reset() == ESP_OK) {
        last_watchdog_feed_ms_ = now;
    }
}

bool RealtimeVoiceApp::connectWiFi() {
    setState(AppState::WifiConnecting);

    if (WiFi.status() == WL_CONNECTED) {
        LOGI("WIFI", "Already connected: %s", WiFi.localIP().toString().c_str());
        return true;
    }

    WiFi.mode(WIFI_STA);
    WiFi.setSleep(false);
    WiFi.setAutoReconnect(true);
    WiFi.begin(app::kWifiSsid, app::kWifiPassword);

    LOGI("WIFI", "Connecting to %s", app::kWifiSsid);
    const uint32_t start_ms = millis();
    while (WiFi.status() != WL_CONNECTED &&
           (millis() - start_ms) < app::kWifiConnectTimeoutMs) {
        feedWatchdog();
        delay(250);
    }

    if (WiFi.status() != WL_CONNECTED) {
        LOGE("WIFI", "Connection timeout");
        return false;
    }

    LOGI(
        "WIFI",
        "Connected ip=%s rssi=%d",
        WiFi.localIP().toString().c_str(),
        WiFi.RSSI());
    return true;
}

bool RealtimeVoiceApp::beginAuxSerial() {
    if (app::kAuxSerialRxPin == app::kAuxSerialTxPin ||
        app::kAuxSerialRxPin < 0 ||
        app::kAuxSerialTxPin < 0) {
        LOGE("APP", "Aux serial pin config invalid");
        return false;
    }

    const int used_pins[] = {
        app::kMicWsPin,
        app::kMicSdPin,
        app::kMicSckPin,
        app::kSpkDinPin,
        app::kSpkBclkPin,
        app::kSpkLrcPin,
        app::kSpkAmpEnablePin,
        app::kRgbLedPin,
    };

    for (const int pin : used_pins) {
        if (app::kAuxSerialRxPin == pin || app::kAuxSerialTxPin == pin) {
            LOGE(
                "APP",
                "Aux serial pin conflict detected RX=%d TX=%d conflict=%d",
                app::kAuxSerialRxPin,
                app::kAuxSerialTxPin,
                pin);
            return false;
        }
    }

    aux_serial_.begin(
        app::kAuxSerialBaud,
        SERIAL_8N1,
        app::kAuxSerialRxPin,
        app::kAuxSerialTxPin);
    LOGI(
        "APP",
        "Aux serial ready baud=%u RX=%d TX=%d",
        static_cast<unsigned>(app::kAuxSerialBaud),
        app::kAuxSerialRxPin,
        app::kAuxSerialTxPin);
    return true;
}

void RealtimeVoiceApp::beginOtaButtons() {
    const int reserved_pins[] = {
        app::kMicWsPin,
        app::kMicSdPin,
        app::kMicSckPin,
        app::kSpkDinPin,
        app::kSpkBclkPin,
        app::kSpkLrcPin,
        app::kSpkAmpEnablePin,
        app::kRgbLedPin,
        app::kAuxSerialRxPin,
        app::kAuxSerialTxPin,
        app::kStm32Boot0Pin,
        app::kStm32Boot1Pin,
        app::kStm32ResetPin,
    };

    auto configure_button = [&](int pin, const char* name, bool& enabled) {
        enabled = false;
        if (pin < 0) {
            LOGW("OTA", "%s button disabled, pin not configured", name);
            return;
        }

        if (isBoardReservedPin(pin)) {
            LOGE(
                "OTA",
                "%s button pin %d is reserved by internal flash/PSRAM on ESP32-S3 N16R8; choose another GPIO",
                name,
                pin);
            return;
        }

        for (const int reserved_pin : reserved_pins) {
            if (pin >= 0 && pin == reserved_pin) {
                LOGE("OTA", "%s button pin %d conflicts with active hardware", name, pin);
                return;
            }
        }

        pinMode(
            pin,
            app::kOtaButtonActiveLevel == LOW ? INPUT_PULLUP : INPUT_PULLDOWN);
        enabled = true;
        LOGI("OTA", "%s button ready on GPIO%d", name, pin);
    };

    if (app::kOtaEsp32ButtonPin == app::kOtaStm32ButtonPin &&
        app::kOtaEsp32ButtonPin >= 0) {
        LOGE(
            "OTA",
            "OTA button pins conflict: esp32=%d stm32=%d",
            app::kOtaEsp32ButtonPin,
            app::kOtaStm32ButtonPin);
    } else {
        configure_button(app::kOtaEsp32ButtonPin, "ESP32 OTA", ota_esp32_button_enabled_);
        configure_button(app::kOtaStm32ButtonPin, "STM32 OTA", ota_stm32_button_enabled_);
    }

    ota_esp32_button_raw_ =
        ota_esp32_button_enabled_ && readOtaButton(app::kOtaEsp32ButtonPin);
    ota_stm32_button_raw_ =
        ota_stm32_button_enabled_ && readOtaButton(app::kOtaStm32ButtonPin);
    ota_esp32_button_pressed_ = ota_esp32_button_raw_;
    ota_stm32_button_pressed_ = ota_stm32_button_raw_;
    ota_esp32_button_changed_ms_ = millis();
    ota_stm32_button_changed_ms_ = millis();
}

bool RealtimeVoiceApp::readOtaButton(int pin) const {
    if (pin < 0) {
        return false;
    }
    return digitalRead(pin) == app::kOtaButtonActiveLevel;
}

bool RealtimeVoiceApp::detectButtonPress(
    int pin,
    bool enabled,
    bool& last_raw,
    bool& stable_pressed,
    uint32_t& last_change_ms) {
    if (!enabled) {
        return false;
    }

    const bool raw_pressed = readOtaButton(pin);
    if (raw_pressed != last_raw) {
        last_raw = raw_pressed;
        last_change_ms = millis();
    }

    if ((millis() - last_change_ms) < app::kOtaButtonDebounceMs) {
        return false;
    }

    if (raw_pressed == stable_pressed) {
        return false;
    }

    stable_pressed = raw_pressed;
    return stable_pressed;
}

bool RealtimeVoiceApp::connectDoubao() {
    setState(AppState::ApiConnecting);
    session_ready_ = false;
    tts_ended_ = false;
    reconnect_after_playback_ = false;
    audio_uplink_enabled_ = false;
    deferred_reconnect_reason_ = "";
    session_id_ = "";
    last_audio_rx_ms_ = 0;
    last_tts_ended_ms_ = 0;

    ws_client_.begin(app::kWsAppId, app::kWsAccessKey);
    if (!ws_client_.connect()) {
        LOGE("APP", "WebSocket connect failed");
        return false;
    }

