reny736/AI-PET-ESP32/src/realtime_voice_app.cpp
    return sendStartConnection();
}

bool RealtimeVoiceApp::sendStartConnection() {
    uint8_t* frame = nullptr;
    size_t frame_len = 0;
    if (!doubao::Protocol::buildStartConnectionFrame(frame, frame_len)) {
        return false;
    }

    const bool ok = ws_client_.sendBinary(frame, frame_len);
    free(frame);
    if (!ok) {
        LOGE("APP", "StartConnection send failed");
        return false;
    }

    LOGI("APP", "StartConnection sent");
    setState(AppState::ApiConnecting);
    return true;
}

bool RealtimeVoiceApp::sendStartSession() {
    session_id_ = makeUuid();

    uint8_t* frame = nullptr;
    size_t frame_len = 0;
    if (!doubao::Protocol::buildStartSessionFrame(session_id_, session_config_, frame, frame_len)) {
        return false;
    }

    const bool ok = ws_client_.sendBinary(frame, frame_len);
    free(frame);
    if (!ok) {
        LOGE("APP", "StartSession send failed");
        return false;
    }

    LOGI("APP", "StartSession sent session_id=%s", session_id_.c_str());
    setState(AppState::SessionStarting);
    return true;
}

bool RealtimeVoiceApp::sendSayHello() {
    uint8_t* frame = nullptr;
    size_t frame_len = 0;
    if (!doubao::Protocol::buildSayHelloFrame(
            session_id_,
            String(app::kHelloText),
            frame,
            frame_len)) {
        return false;
    }

    const bool ok = ws_client_.sendBinary(frame, frame_len);
    free(frame);
    if (!ok) {
        LOGE("APP", "SayHello send failed");
        return false;
    }

    LOGI("APP", "SayHello sent");
    audio_uplink_enabled_ = false;
    setState(AppState::Thinking);
    thinking_started_ms_ = millis();
    return true;
}

void RealtimeVoiceApp::startListening() {
    audio_.stopPlayback(true);
    audio_.startCapture();
    audio_uplink_enabled_ = true;
    tts_ended_ = false;
    listening_started_ms_ = millis();
    setState(AppState::Listening);
    LOGI("APP", "Listening started");
}

void RealtimeVoiceApp::stopListeningForThinking() {
    audio_uplink_enabled_ = true;
    thinking_started_ms_ = millis();
    setState(AppState::Thinking);
    LOGI(
        "APP",
        "Speech end detected, keep streaming until server finalizes ASR, buffered=%uB",
        static_cast<unsigned>(audio_.captureBufferedBytes()));
}

void RealtimeVoiceApp::serviceSerialCommands() {
    while (Serial.available() > 0) {
        const int ch = Serial.read();
        if (ch < 0) {
            break;
        }
        if (ch == '\r') {
            continue;
        }
        if (ch == '\n') {
            serial_command_buffer_.trim();
            if (serial_command_buffer_.length() > 0) {
                handleSerialCommand(serial_command_buffer_);
                serial_command_buffer_ = "";
            }
            continue;
        }
        if (serial_command_buffer_.length() < app::kSerialCommandMaxLength) {
            serial_command_buffer_ += static_cast<char>(ch);
        }
    }
}

void RealtimeVoiceApp::serviceAuxSerial() {
    while (aux_serial_.available() > 0) {
        const int value = aux_serial_.read();
        if (value < 0) {
            break;
        }

        const uint8_t byte_value = static_cast<uint8_t>(value);
        if (byte_value == app::kApiTriggerByte) {
            requestApiActivation();
            continue;
        }

        aux_serial_.write(&byte_value, 1);
        if (api_activation_requested_ ||
            reconnect_after_playback_ ||
            ws_client_.isConnected()) {
            deactivateApiConnection("UART1 data byte received");
        }
    }
}

void RealtimeVoiceApp::handleSerialCommand(const String& command) {
    String normalized = command;
    normalized.trim();
    normalized.toLowerCase();

    if (normalized == "help" || normalized == "?") {
        printSerialHelp();
        return;
    }

    if (normalized == "ota" || normalized.startsWith("ota ")) {
        handleOtaCommand(command);
        return;
    }

    if (normalized == "mute") {
        applySpeakerVolume(0, true, "serial");
        return;
    }

    if (normalized == "vol" || normalized == "volume") {
        LOGI("APP", "Speaker volume=%u%%", static_cast<unsigned>(audio_.speakerVolumePercent()));
        return;
    }

    if (normalized == "vol +" || normalized == "volume +" ||
        normalized == "vol up" || normalized == "volume up") {
        applySpeakerVolume(
            audio_.speakerVolumePercent() + app::kSpeakerVolumeStepPercent,
            true,
            "serial");
        return;
    }

    if (normalized == "vol -" || normalized == "volume -" ||
        normalized == "vol down" || normalized == "volume down") {
        const int next_volume =
            static_cast<int>(audio_.speakerVolumePercent()) - app::kSpeakerVolumeStepPercent;
        applySpeakerVolume(next_volume, true, "serial");
        return;
    }

    String argument;
    if (normalized.startsWith("vol ")) {
        argument = command.substring(4);
    } else if (normalized.startsWith("volume ")) {
        argument = command.substring(7);
    }

    argument.trim();
    if (argument.length() > 0) {
        int requested_volume = 0;
        if (!parseIntStrict(argument, requested_volume)) {
            LOGW("APP", "Invalid volume command: %s", command.c_str());
            printSerialHelp();
            return;
        }

        applySpeakerVolume(requested_volume, true, "serial");
        return;
    }

    LOGW("APP", "Unknown serial command: %s", command.c_str());
    printSerialHelp();
}

void RealtimeVoiceApp::serviceOtaButtons() {
    if (detectButtonPress(
            app::kOtaEsp32ButtonPin,
            ota_esp32_button_enabled_,
            ota_esp32_button_raw_,
            ota_esp32_button_pressed_,
            ota_esp32_button_changed_ms_)) {
        enterOtaMode(OtaTarget::Esp32Self, "esp32 ota button");
    }

    if (detectButtonPress(
            app::kOtaStm32ButtonPin,
            ota_stm32_button_enabled_,
            ota_stm32_button_raw_,
            ota_stm32_button_pressed_,
            ota_stm32_button_changed_ms_)) {
        enterOtaMode(OtaTarget::Stm32, "stm32 ota button");
    }
}

void RealtimeVoiceApp::serviceOtaMode() {
    if (state_ != AppState::Ota || ota_mode_request_seen_) {
        return;
    }

