reny736/AI-PET-ESP32/src/realtime_voice_app.cpp
    const uint32_t now = millis();
    if ((now - ota_mode_started_ms_) >= app::kOtaRequestWindowMs) {
        exitOtaMode("OTA request timeout");
        return;
    }

    if ((now - ota_last_attempt_ms_) < app::kOtaAutoRetryIntervalMs) {
        return;
    }

    ota_last_attempt_ms_ = now;
    const OtaTarget target = ota_.selectedTarget();
    OtaRequestResolution resolution;
    String detail;
    if (!resolveConfiguredOtaRequest(target, resolution, detail)) {
        LOGW("OTA", "Auto resolve failed: %s", detail.c_str());
        return;
    }

    if (resolution.manifest_used) {
        const String installed_version = currentOtaVersion(target);
        LOGI(
            "OTA",
            "Manifest target=%s current=%s latest=%s",
            ota_.selectedTargetName(),
            installed_version.c_str(),
            resolution.version.length() > 0 ? resolution.version.c_str() : "(unknown)");
        if (resolution.update_log.length() > 0) {
            LOGI("OTA", "Update log: %s", resolution.update_log.c_str());
        }
    } else if (detail.length() > 0) {
        LOGI("OTA", "%s", detail.c_str());
    }

    if (resolution.already_latest) {
        const String installed_version = currentOtaVersion(target);
        LOGI(
            "OTA",
            "Target=%s already at latest version=%s",
            ota_.selectedTargetName(),
            installed_version.c_str());
        exitOtaMode("OTA already current");
        return;
    }

    LOGI("OTA", "Auto pull target=%s url=%s", ota_.selectedTargetName(), resolution.url.c_str());
    if (runOtaUpdate(target, resolution.url, resolution.sha256, resolution.version)) {
        ota_mode_request_seen_ = true;
        exitOtaMode("OTA finished");
        return;
    }

    setState(AppState::Ota);
    LOGW("OTA", "Auto pull failed: %s", ota_.lastError().c_str());
}

void RealtimeVoiceApp::sendStm32StopCommand() {
    const uint8_t stop_byte = app::kStm32StopCommandByte;
    aux_serial_.write(&stop_byte, 1);
    aux_serial_.flush();
    LOGI("OTA", "Sent STM32 stop command 0x%02X", static_cast<unsigned>(stop_byte));
}

bool RealtimeVoiceApp::enterOtaMode(OtaTarget target, const char* reason) {
    if (state_ != AppState::Ota) {
        if (!prepareForOta(reason)) {
            return false;
        }
        if (target != OtaTarget::Stm32) {
            sendStm32StopCommand();
        }
    }

    ota_.setSelectedTarget(target);
    ota_mode_request_seen_ = false;
    ota_mode_started_ms_ = millis();
    ota_last_attempt_ms_ = ota_mode_started_ms_ - app::kOtaAutoRetryIntervalMs;
    setState(AppState::Ota);

    LOGI(
        "OTA",
        "Mode=%s armed for %u ms, source=%s",
        ota_.selectedTargetName(),
        static_cast<unsigned>(app::kOtaRequestWindowMs),
        defaultOtaManifestUrl(target)[0] != '\0' ? defaultOtaManifestUrl(target) : defaultOtaUrl(target));
    if (WiFi.status() == WL_CONNECTED) {
        LOGI("OTA", "WiFi ip=%s", WiFi.localIP().toString().c_str());
    }
    return true;
}

void RealtimeVoiceApp::exitOtaMode(const char* reason) {
    LOGI("OTA", "Exiting OTA mode: %s", reason != nullptr ? reason : "done");
    delay(100);
    ESP.restart();
}

void RealtimeVoiceApp::requestApiActivation() {
    if (api_activation_requested_) {
        return;
    }

    api_activation_requested_ = true;
    LOGI("APP", "Aux serial trigger received, enabling API connect");

    if (WiFi.status() != WL_CONNECTED) {
        scheduleReconnect("aux trigger wifi reconnect");
        return;
    }

    if (!ws_client_.isConnected() && !connectDoubao()) {
        scheduleReconnect("aux trigger API connect failed");
    }
}

void RealtimeVoiceApp::deactivateApiConnection(const char* reason) {
    const bool had_api_activity =
        api_activation_requested_ ||
        reconnect_after_playback_ ||
        ws_client_.isConnected();

    api_activation_requested_ = false;
    reconnect_scheduled_ = false;
    reconnect_after_playback_ = false;
    reconnect_at_ms_ = 0;
    session_ready_ = false;
    tts_ended_ = false;
    audio_uplink_enabled_ = false;
    deferred_reconnect_reason_ = "";
    session_id_ = "";
    last_audio_rx_ms_ = 0;
    last_tts_ended_ms_ = 0;

    audio_.stopCapture();
    audio_.stopPlayback(true);
    ws_client_.disconnect();

    if (WiFi.status() == WL_CONNECTED) {
        setState(AppState::Standby);
    } else {
        setState(AppState::Error);
    }

    if (had_api_activity) {
        LOGI(
            "APP",
            "API disconnected by UART1 request: %s, waiting trigger 0x%02X",
            reason != nullptr ? reason : "manual",
            static_cast<unsigned>(app::kApiTriggerByte));
    }
}

void RealtimeVoiceApp::loadSpeakerVolumePreference() {
    Preferences prefs;
    uint8_t stored_volume = app::kSpeakerVolumeDefaultPercent;
    if (prefs.begin(app::kVolumePrefsNamespace, false)) {
        if (prefs.isKey(app::kVolumePrefsKey)) {
            stored_volume =
                prefs.getUChar(app::kVolumePrefsKey, app::kSpeakerVolumeDefaultPercent);
        }
        prefs.end();
    } else {
        LOGW("APP", "Volume preferences open failed, using default");
    }

    applySpeakerVolume(stored_volume, false, "boot");
}

void RealtimeVoiceApp::saveSpeakerVolumePreference(uint8_t volume_percent) {
    Preferences prefs;
    if (!prefs.begin(app::kVolumePrefsNamespace, false)) {
        LOGW("APP", "Volume preferences save failed");
        return;
    }
    prefs.putUChar(app::kVolumePrefsKey, volume_percent);
    prefs.end();
}

void RealtimeVoiceApp::applySpeakerVolume(int volume_percent, bool persist, const char* source) {
    const uint8_t clamped = static_cast<uint8_t>(constrain(
        volume_percent,
        app::kSpeakerVolumeMinPercent,
        app::kSpeakerVolumeMaxPercent));
    const uint8_t previous = audio_.speakerVolumePercent();
    audio_.setSpeakerVolumePercent(clamped);

    if (persist) {
        saveSpeakerVolumePreference(clamped);
    }

    if (previous != clamped || source != nullptr) {
        LOGI(
            "APP",
            "Speaker volume set to %u%% (%s)",
            static_cast<unsigned>(clamped),
            source != nullptr ? source : "runtime");
        if (clamped > 100) {
            LOGW("APP", "Volume above 100%% may introduce clipping noise");
        }
    }
}

void RealtimeVoiceApp::printSerialHelp() {
    LOGI(
        "APP",
        "Serial cmds: `vol`, `vol 80`, `vol +`, `vol -`, `mute`, `ota ...`, `help`");
    LOGI(
        "APP",
        "OTA trigger: press ESP32/STM32 OTA button -> auto read manifest/direct package within 5s");
}

void RealtimeVoiceApp::printOtaHelp() {
    LOGI(
        "OTA",
        "OTA flow: press ESP32/STM32 OTA button -> auto read manifest, compare version, then update");
    LOGI(
        "OTA",
        "OTA cmds: `ota status`, `ota start [url] [sha256] [version]`, `ota target esp|stm`, `ota exit`");
    LOGI(
        "OTA",
        "Server=%s esp32_manifest=%s stm32_manifest=%s",
        app::kOtaServerBaseUrl,
        app::kOtaEsp32ManifestUrl,
        app::kOtaStm32ManifestUrl[0] == '\0' ? "(disabled)" : app::kOtaStm32ManifestUrl);
    LOGI(
        "OTA",
        "Current versions: esp32=%s stm32=%s",
        currentOtaVersion(OtaTarget::Esp32Self).c_str(),
        currentOtaVersion(OtaTarget::Stm32).c_str());
    LOGI(
        "OTA",
        "Fallback urls: esp32=%s stm32=%s",
        app::kOtaEsp32DefaultUrl,
        app::kOtaStm32DefaultUrl);
    LOGI(
        "OTA",
        "Buttons esp32=%d stm32=%d active_level=%d auto_stm32=%s BOOT0=%d NRST=%d BOOT1=%d",
        app::kOtaEsp32ButtonPin,
        app::kOtaStm32ButtonPin,
        app::kOtaButtonActiveLevel,
        ota_.canAutoEnterStm32Bootloader() ? "yes" : "no",
        app::kStm32Boot0Pin,
        app::kStm32ResetPin,
        app::kStm32Boot1Pin);
    LOGI("OTA", "ESP32-S3 N16R8 reserved GPIOs for internal memory: 35, 36, 37");
}

bool RealtimeVoiceApp::prepareForOta(const char* reason) {
    LOGI("OTA", "Preparing maintenance mode: %s", reason != nullptr ? reason : "manual");
    deactivateApiConnection("OTA requested");
    setState(AppState::Ota);

    if (WiFi.status() == WL_CONNECTED) {
        return true;
    }

    if (!connectWiFi()) {
        setState(AppState::Error);
        LOGE("OTA", "WiFi reconnect failed");
        return false;
    }

