reny736/AI-PET-ESP32/src/realtime_voice_app.cpp
    setState(AppState::Ota);
    return true;
}

bool RealtimeVoiceApp::runOtaUpdate(
    OtaTarget target,
    const String& url,
    const String& expected_sha256,
    const String& resolved_version) {
    const bool keep_ota_mode = (state_ == AppState::Ota);
    if (url.length() == 0) {
        LOGE("OTA", "OTA URL is empty");
        return false;
    }

    if (state_ != AppState::Ota) {
        if (!prepareForOta(target == OtaTarget::Esp32Self ? "esp32 update" : "stm32 update")) {
            return false;
        }
    } else if (WiFi.status() != WL_CONNECTED) {
        if (!connectWiFi()) {
            setState(AppState::Error);
            LOGE("OTA", "WiFi reconnect failed before OTA");
            return false;
        }
        setState(AppState::Ota);
    }

    ota_.setSelectedTarget(target);
    const bool ok = ota_.runSelectedUpdate(url, expected_sha256);

    if (ok && resolved_version.length() > 0) {
        if (saveInstalledOtaVersion(target, resolved_version)) {
            LOGI("OTA", "Recorded %s installed version=%s", ota_.selectedTargetName(), resolved_version.c_str());
        } else {
            LOGW("OTA", "Failed to persist %s installed version=%s", ota_.selectedTargetName(), resolved_version.c_str());
        }
    }

    if (target == OtaTarget::Esp32Self) {
        if (!ok) {
            setState(
                keep_ota_mode ? AppState::Ota
                              : (WiFi.status() == WL_CONNECTED ? AppState::Standby : AppState::Error));
        }
        return ok;
    }

    if (ok) {
        setState(
            keep_ota_mode ? AppState::Ota
                          : (WiFi.status() == WL_CONNECTED ? AppState::Standby : AppState::Error));
        LOGI("OTA", "STM32 OTA finished");
        return true;
    }

    setState(
        keep_ota_mode ? AppState::Ota
                      : (WiFi.status() == WL_CONNECTED ? AppState::Standby : AppState::Error));
    LOGE("OTA", "STM32 OTA failed: %s", ota_.lastError().c_str());
    return false;
}

void RealtimeVoiceApp::handleOtaCommand(const String& command) {
    String payload = command;
    payload.trim();
    if (payload.length() >= 3) {
        payload = payload.substring(3);
    } else {
        payload = "";
    }
    payload.trim();

    if (payload.length() == 0 || payload.equalsIgnoreCase("help")) {
        printOtaHelp();
        return;
    }

    String action = takeToken(payload);
    String action_lower = action;
    action_lower.toLowerCase();

    if (action_lower == "status") {
        const uint32_t elapsed_ms = millis() - ota_mode_started_ms_;
        const uint32_t remaining_ms =
            elapsed_ms >= app::kOtaRequestWindowMs ? 0 : (app::kOtaRequestWindowMs - elapsed_ms);
        LOGI(
            "OTA",
            "state=%s target=%s wifi=%s request_seen=%s remaining_ms=%u",
            state_ == AppState::Ota ? "armed" : "idle",
            ota_.selectedTargetName(),
            WiFi.status() == WL_CONNECTED ? "connected" : "disconnected",
            ota_mode_request_seen_ ? "yes" : "no",
            static_cast<unsigned>(remaining_ms));
        LOGI(
            "OTA",
            "versions esp32=%s stm32=%s manifests esp32=%s stm32=%s",
            currentOtaVersion(OtaTarget::Esp32Self).c_str(),
            currentOtaVersion(OtaTarget::Stm32).c_str(),
            app::kOtaEsp32ManifestUrl,
            app::kOtaStm32ManifestUrl[0] == '\0' ? "(disabled)" : app::kOtaStm32ManifestUrl);
        return;
    }

    if (action_lower == "exit") {
        if (state_ != AppState::Ota) {
            LOGW("OTA", "OTA mode is not active");
            return;
        }
        exitOtaMode("serial exit");
        return;
    }

    if (action_lower == "target") {
        if (state_ != AppState::Ota) {
            LOGW("OTA", "Press the OTA button first");
            return;
        }
        String target = takeToken(payload);
        target.toLowerCase();
        if (target == "esp" || target == "esp32") {
            ota_.setSelectedTarget(OtaTarget::Esp32Self);
            ota_mode_started_ms_ = millis();
            ota_last_attempt_ms_ = ota_mode_started_ms_ - app::kOtaAutoRetryIntervalMs;
            LOGI("OTA", "Selected OTA target=esp32");
            return;
        }
        if (target == "stm" || target == "stm32") {
            ota_.setSelectedTarget(OtaTarget::Stm32);
            ota_mode_started_ms_ = millis();
            ota_last_attempt_ms_ = ota_mode_started_ms_ - app::kOtaAutoRetryIntervalMs;
            LOGI("OTA", "Selected OTA target=stm32");
            return;
        }
        LOGW("OTA", "Unknown OTA target: %s", target.c_str());
        printOtaHelp();
        return;
    }

    if (action_lower == "start") {
        if (state_ != AppState::Ota) {
            LOGW("OTA", "Press the OTA button first");
            return;
        }
        String url = takeToken(payload);
        String sha256 = takeToken(payload);
        if (url.length() == 0) {
            OtaRequestResolution resolution;
            String detail;
            if (!resolveConfiguredOtaRequest(ota_.selectedTarget(), resolution, detail)) {
                LOGW("OTA", "Manual resolve failed: %s", detail.c_str());
                return;
            }
            if (resolution.manifest_used) {
                const String installed_version = currentOtaVersion(ota_.selectedTarget());
                LOGI(
                    "OTA",
                    "Manual manifest latest=%s current=%s",
                    resolution.version.c_str(),
                    installed_version.c_str());
            } else if (detail.length() > 0) {
                LOGI("OTA", "%s", detail.c_str());
            }
            if (resolution.already_latest) {
                exitOtaMode("OTA already current");
                return;
            }
            url = resolution.url;
            if (sha256.length() == 0) {
                sha256 = resolution.sha256;
            }
            if (payload.length() == 0) {
                payload = resolution.version;
            }
        }
        if (sha256.length() == 0) {
            sha256 = defaultOtaSha256(ota_.selectedTarget());
        }
        ota_mode_request_seen_ = true;
        const String resolved_version = trimCopy(payload);
        if (runOtaUpdate(ota_.selectedTarget(), url, sha256, resolved_version)) {
            exitOtaMode("OTA finished");
            return;
        }
        ota_mode_request_seen_ = false;
        ota_mode_started_ms_ = millis();
        ota_last_attempt_ms_ = ota_mode_started_ms_ - app::kOtaAutoRetryIntervalMs;
        setState(AppState::Ota);
        LOGW("OTA", "Manual OTA failed: %s", ota_.lastError().c_str());
        return;
    }

    if (action_lower == "esp" || action_lower == "esp32") {
        if (state_ != AppState::Ota) {
            LOGW("OTA", "Press the ESP32 OTA button first");
            return;
        }
        String url = takeToken(payload);
        String sha256 = takeToken(payload);
        if (url.length() == 0) {
            OtaRequestResolution resolution;
            String detail;
            if (!resolveConfiguredOtaRequest(OtaTarget::Esp32Self, resolution, detail)) {
                LOGW("OTA", "Manual ESP32 resolve failed: %s", detail.c_str());
                return;
            }
            if (resolution.manifest_used) {
                const String installed_version = currentOtaVersion(OtaTarget::Esp32Self);
                LOGI(
                    "OTA",
                    "ESP32 manifest latest=%s current=%s",
                    resolution.version.c_str(),
                    installed_version.c_str());
            } else if (detail.length() > 0) {
                LOGI("OTA", "%s", detail.c_str());
            }
            if (resolution.already_latest) {
                exitOtaMode("OTA already current");
                return;
            }
            url = resolution.url;
            if (sha256.length() == 0) {
                sha256 = resolution.sha256;
            }
            if (payload.length() == 0) {
                payload = resolution.version;
            }
        }
        if (sha256.length() == 0) {
            sha256 = defaultOtaSha256(OtaTarget::Esp32Self);
        }
        ota_mode_request_seen_ = true;
        const String resolved_version = trimCopy(payload);
        if (runOtaUpdate(OtaTarget::Esp32Self, url, sha256, resolved_version)) {
            exitOtaMode("OTA finished");
            return;
        }
        ota_mode_request_seen_ = false;
        ota_mode_started_ms_ = millis();
        ota_last_attempt_ms_ = ota_mode_started_ms_ - app::kOtaAutoRetryIntervalMs;
        setState(AppState::Ota);
        LOGW("OTA", "Manual ESP32 OTA failed: %s", ota_.lastError().c_str());
        return;
    }

    if (action_lower == "stm" || action_lower == "stm32") {
        if (state_ != AppState::Ota) {
            LOGW("OTA", "Press the STM32 OTA button first");
            return;
        }
        String url = takeToken(payload);
        String sha256 = takeToken(payload);
        if (url.length() == 0) {
            OtaRequestResolution resolution;
            String detail;
            if (!resolveConfiguredOtaRequest(OtaTarget::Stm32, resolution, detail)) {
                LOGW("OTA", "Manual STM32 resolve failed: %s", detail.c_str());
                return;
            }
            if (resolution.manifest_used) {
                const String installed_version = currentOtaVersion(OtaTarget::Stm32);
                LOGI(
                    "OTA",
                    "STM32 manifest latest=%s current=%s",
                    resolution.version.c_str(),
                    installed_version.c_str());
            } else if (detail.length() > 0) {
                LOGI("OTA", "%s", detail.c_str());
            }
            if (resolution.already_latest) {
                exitOtaMode("OTA already current");
                return;
            }
            url = resolution.url;
            if (sha256.length() == 0) {
                sha256 = resolution.sha256;
            }
            if (payload.length() == 0) {
                payload = resolution.version;
            }
        }
        if (sha256.length() == 0) {
            sha256 = defaultOtaSha256(OtaTarget::Stm32);
        }
        ota_mode_request_seen_ = true;
        const String resolved_version = trimCopy(payload);
        if (runOtaUpdate(OtaTarget::Stm32, url, sha256, resolved_version)) {
            exitOtaMode("OTA finished");
            return;
        }
        ota_mode_request_seen_ = false;
        ota_mode_started_ms_ = millis();
        ota_last_attempt_ms_ = ota_mode_started_ms_ - app::kOtaAutoRetryIntervalMs;
        setState(AppState::Ota);
        LOGW("OTA", "Manual STM32 OTA failed: %s", ota_.lastError().c_str());
        return;
    }

    LOGW("OTA", "Unknown OTA command: %s", command.c_str());
    printOtaHelp();
}

void RealtimeVoiceApp::setState(AppState state) {
    state_ = state;

    switch (state_) {
        case AppState::Booting:
            led_.setState(LedState::Booting);
            break;
        case AppState::WifiConnecting:
            led_.setState(LedState::WifiConnecting);
            break;
        case AppState::Standby:
            led_.setState(LedState::Standby);
            break;
        case AppState::ApiConnecting:
        case AppState::SessionStarting:
            led_.setState(LedState::ApiConnecting);
            break;
        case AppState::Ota:
            led_.setState(LedState::Ota);
            break;
        case AppState::Listening:
            led_.setState(LedState::Listening);
            break;
        case AppState::Thinking:
            led_.setState(LedState::Thinking);
            break;
        case AppState::Speaking:
            led_.setState(LedState::Speaking);
            break;
        case AppState::Error:
            led_.setState(LedState::Error);
            break;
        default:
            led_.setState(LedState::Off);
            break;
    }
}

void RealtimeVoiceApp::scheduleReconnect(const char* reason, bool allow_playback_drain) {
    if (allow_playback_drain &&
        state_ == AppState::Speaking &&
        audio_.playbackBufferedBytes() > 0) {
        session_ready_ = false;
        tts_ended_ = true;
        last_tts_ended_ms_ = millis();
        reconnect_after_playback_ = true;
        deferred_reconnect_reason_ = reason;
        audio_.markPlaybackStreamEnded();
        LOGW("APP", "Deferring reconnect until playback completes: %s", reason);
        return;
    }

