reny736/AI-PET-ESP32/src/realtime_voice_app.cpp
    LOGW("APP", "Scheduling reconnect: %s", reason);
    session_ready_ = false;
    tts_ended_ = false;
    reconnect_after_playback_ = false;
    audio_uplink_enabled_ = false;
    deferred_reconnect_reason_ = "";
    audio_.stopCapture();
    audio_.stopPlayback(true);
    ws_client_.disconnect();
    setState(AppState::Error);
    reconnect_scheduled_ = true;
    reconnect_at_ms_ = millis() + app::kReconnectDelayMs;
}

void RealtimeVoiceApp::reconnectIfNeeded() {
    if (!reconnect_scheduled_) {
        return;
    }
    if (millis() < reconnect_at_ms_) {
        return;
    }

    reconnect_scheduled_ = false;
    LOGI("APP", "Reconnecting...");

    const bool wifi_ready =
        (WiFi.status() == WL_CONNECTED) || connectWiFi();
    if (!wifi_ready) {
        scheduleReconnect("WiFi reconnect failed");
        return;
    }

    if (!api_activation_requested_) {
        setState(AppState::Standby);
        LOGI(
            "APP",
            "WiFi restored, waiting aux serial trigger 0x%02X",
            static_cast<unsigned>(app::kApiTriggerByte));
        return;
    }

    if (!connectDoubao()) {
        scheduleReconnect("API reconnect failed");
    }
}

void RealtimeVoiceApp::serviceAudioUplink() {
    if (!session_ready_ ||
        !audio_uplink_enabled_ ||
        (state_ != AppState::Listening && state_ != AppState::Thinking)) {
        return;
    }

    uint8_t packet[app::kTxFrameBytes * app::kAudioFramesPerPacket];
    uint8_t ws_frame[app::kAudioWsFrameBufferBytes];
    uint8_t packets_sent = 0;
    while (audio_.captureBufferedBytes() >= app::kTxFrameBytes &&
           packets_sent < app::kAudioPacketsPerLoop) {
        const size_t available_frames =
            audio_.captureBufferedBytes() / app::kTxFrameBytes;
        const size_t frames_to_bundle =
            available_frames >= app::kAudioFramesPerPacket ? app::kAudioFramesPerPacket : 1;
        const size_t bytes_to_read = frames_to_bundle * app::kTxFrameBytes;

        const size_t audio_bytes = audio_.readCaptureAudio(packet, bytes_to_read);
        if (audio_bytes == 0) {
            break;
        }

        size_t ws_frame_len = 0;
        if (!doubao::Protocol::buildAudioFrameInto(
                session_id_,
                packet,
                audio_bytes,
                ws_frame,
                sizeof(ws_frame),
                ws_frame_len)) {
            scheduleReconnect("audio frame build failed");
            return;
        }

        const bool ok = ws_client_.sendBinary(ws_frame, ws_frame_len);
        if (!ok) {
            scheduleReconnect("audio send failed");
            return;
        }

        ++packets_sent;
    }

    if (state_ == AppState::Thinking &&
        packets_sent > 0 &&
        audio_.captureBufferedBytes() == 0) {
        LOGI("APP", "Final speech audio flushed to server");
    }
}

void RealtimeVoiceApp::serviceConversationState() {
    if (state_ == AppState::Speaking) {
        if (tts_ended_ &&
            audio_.playbackBufferedBytes() == 0 &&
            (millis() - last_audio_rx_ms_) > app::kPlaybackDrainGraceMs) {
            if (reconnect_after_playback_) {
                const String reason = deferred_reconnect_reason_;
                reconnect_after_playback_ = false;
                deferred_reconnect_reason_ = "";
                scheduleReconnect(reason.c_str());
                return;
            }
            LOGI("APP", "Playback complete, switching back to listening");
            startListening();
        }
    } else if (state_ == AppState::Thinking) {
        if (tts_ended_ &&
            (millis() - last_tts_ended_ms_) > app::kPlaybackDrainGraceMs &&
            audio_.playbackBufferedBytes() == 0) {
            startListening();
        }
    }
}

void RealtimeVoiceApp::printMonitor() {
    if ((millis() - last_monitor_ms_) < app::kMonitorIntervalMs) {
        return;
    }
    last_monitor_ms_ = millis();

    const AudioStats stats = audio_.stats();
    LOGD(
        "MON",
        "state=%s wifi=%d vol=%u%% tx=%uB rx=%uB rms=%d heap=%u",
        stateName(state_),
        WiFi.RSSI(),
        static_cast<unsigned>(audio_.speakerVolumePercent()),
        static_cast<unsigned>(stats.tx_buffered_bytes),
        static_cast<unsigned>(stats.rx_buffered_bytes),
        stats.last_mic_rms,
        static_cast<unsigned>(ESP.getFreeHeap()));
}

void RealtimeVoiceApp::handleSpeechStateChanged(bool speaking) {
    if (state_ != AppState::Listening) {
        return;
    }

    if (speaking) {
        LOGI("APP", "Speech started");
        return;
    }

    const uint32_t elapsed = millis() - listening_started_ms_;
    LOGI("APP", "Speech ended after %u ms", static_cast<unsigned>(elapsed));
    stopListeningForThinking();
}

void RealtimeVoiceApp::handleSocketMessage(const uint8_t* data, size_t len) {
    doubao::ServerMessage message;
    if (!doubao::Protocol::parseServerMessage(data, len, message)) {
        LOGW("APP", "Failed to parse server frame");
        logutil::hexDump("WSS", data, len);
        return;
    }

    if (message.session_id.length() > 0 &&
        session_id_.length() > 0 &&
        message.session_id != session_id_) {
        LOGW(
            "APP",
            "Ignoring stale session event: msg_session=%s current_session=%s",
            message.session_id.c_str(),
            session_id_.c_str());
        doubao::Protocol::freeServerMessage(message);
        return;
    }

    if (message.is_error) {
        LOGE("APP", "Server error %u %s", static_cast<unsigned>(message.error_code), message.payload_json.c_str());
        doubao::Protocol::freeServerMessage(message);
        scheduleReconnect("server error");
        return;
    }

    if (message.message_type == doubao::kServerAudioResponse) {
        handleServerAudio(message);
    } else if (message.message_type == doubao::kServerFullResponse && message.has_event) {
        handleServerEvent(message);
    }

    doubao::Protocol::freeServerMessage(message);
}

void RealtimeVoiceApp::handleSocketDisconnected() {
    if (reconnect_scheduled_ || reconnect_after_playback_) {
        return;
    }
    if (!api_activation_requested_) {
        if (WiFi.status() == WL_CONNECTED) {
            setState(AppState::Standby);
        }
        return;
    }
    scheduleReconnect("socket disconnected", true);
}

