reny736/AI-PET-ESP32/src/realtime_voice_app.cpp
void RealtimeVoiceApp::handleServerEvent(const doubao::ServerMessage& message) {
    LOGD("APP", "Event %u", static_cast<unsigned>(message.event));

    switch (message.event) {
        case doubao::kConnectionStarted:
            LOGI("APP", "Connection started");
            if (!sendStartSession()) {
                scheduleReconnect("start session failed");
            }
            break;

        case doubao::kSessionStarted:
            session_ready_ = true;
            LOGI("APP", "Session started: %s", session_id_.c_str());
            if (app::kAutoSayHello) {
                if (!sendSayHello()) {
                    scheduleReconnect("say hello failed");
                }
            } else {
                startListening();
            }
            break;

        case doubao::kTtsSentenceStart:
            if (state_ == AppState::Thinking) {
                audio_uplink_enabled_ = false;
                audio_.clearCaptureBuffer();
            }
            if (state_ == AppState::Thinking && audio_.isCapturing()) {
                audio_.stopCapture();
                LOGI("APP", "Capture stopped, server started TTS");
            }
            LOGI("APP", "TTS sentence start");
            break;

        case doubao::kTtsSentenceEnd:
            LOGD("APP", "TTS sentence end");
            break;

        case doubao::kTtsEnded:
            tts_ended_ = true;
            last_tts_ended_ms_ = millis();
            audio_.markPlaybackStreamEnded();
            LOGI("APP", "TTS ended");
            break;

        case doubao::kAsrInfo:
            LOGD("APP", "ASR info %s", summarizePayload(message.payload_json).c_str());
            break;
        case doubao::kAsrResponse:
            LOGD("APP", "ASR response %s", summarizePayload(message.payload_json).c_str());
            break;
        case doubao::kAsrEnded:
            if (state_ == AppState::Thinking) {
                audio_uplink_enabled_ = false;
                audio_.clearCaptureBuffer();
            }
            if (state_ == AppState::Thinking && audio_.isCapturing()) {
                audio_.stopCapture();
                LOGI("APP", "Capture stopped, ASR finalized");
            }
            LOGI("APP", "ASR ended %s", summarizePayload(message.payload_json).c_str());
            break;
        case doubao::kUsageResponse:
            if (message.payload_json.length() > 0) {
                LOGI(
                    "APP",
                    "Usage %s",
                    summarizePayload(message.payload_json).c_str());
            }
            break;
        case doubao::kChatResponse:
            LOGD("APP", "Chat response %s", summarizePayload(message.payload_json).c_str());
            break;
        case doubao::kChatEnded:
            LOGI("APP", "Chat ended %s", summarizePayload(message.payload_json).c_str());
            break;

        case doubao::kDialogError:
            if (isRecoverableDialogError(message.payload_json)) {
                LOGW(
                    "APP",
                    "Recoverable dialog error: event=%u payload=%s",
                    static_cast<unsigned>(message.event),
                    summarizePayload(message.payload_json).c_str());
                if (state_ != AppState::Speaking) {
                    startListening();
                }
                break;
            }
            LOGW(
                "APP",
                "Conversation event failed: event=%u payload=%s",
                static_cast<unsigned>(message.event),
                summarizePayload(message.payload_json).c_str());
            scheduleReconnect("conversation event failed");
            break;
        case doubao::kConnectionFailed:
        case doubao::kConnectionFinished:
        case doubao::kSessionFailed:
        case doubao::kSessionFinished:
            LOGW(
                "APP",
                "Conversation event failed: event=%u payload=%s",
                static_cast<unsigned>(message.event),
                summarizePayload(message.payload_json).c_str());
            scheduleReconnect("conversation event failed");
            break;

        default:
            break;
    }
}

void RealtimeVoiceApp::handleServerAudio(const doubao::ServerMessage& message) {
    if (message.payload == nullptr || message.payload_length == 0) {
        return;
    }

    if (audio_.isCapturing()) {
        audio_.stopCapture();
    }
    audio_uplink_enabled_ = false;
    audio_.clearCaptureBuffer();

    audio_.pushPlaybackAudio(message.payload, message.payload_length);
    last_audio_rx_ms_ = millis();
    tts_ended_ = false;

    if (state_ != AppState::Speaking) {
        setState(AppState::Speaking);
        const uint32_t latency = millis() - thinking_started_ms_;
        LOGI("APP", "First audio packet in %u ms", static_cast<unsigned>(latency));
    }
}
